In [9]:
import pandas as pd
import numpy as np

### Replace a Scalar Value on a Specific Column

In [10]:
df = pd.DataFrame({
    'Name':["maryam","Mohamed","Mailk"],
    'Age':[25,30,35],
    'Gender':["Female","Male","Male"]
})

df.replace('Male', 'M', inplace=True)
df.replace('Female','F',inplace=True)

df

      Name  Age Gender
0   maryam   25      F
1  Mohamed   30      M
2    Mailk   35      M

### Replace Multiple Values on a Specific Column

In [11]:
df = pd.DataFrame({
    'Name':["Alice","David","jhon","Yamach"],
    'Age':[20,30,35,29],
    'Grade':["A","B","c","d"]
})

df.replace(["A","B"], "Pass", inplace=True)
df.replace(["c","d"], "Fail", inplace=True)

df

     Name  Age Grade
0   Alice   20  Pass
1   David   30  Pass
2    jhon   35  Fail
3  Yamach   29  Fail

### Replace Values on Multiple Columns

In [13]:
df = pd.DataFrame({'height': [175, 180, np.nan, 170],
                   'weight': [70, np.nan, 80, 75]})

mean_height = df['height'].mean()
mean_weight = df['weight'].mean()

df.replace({'height': 'NaN', 'weight': 'NaN'},
           {'height': mean_height, 'weight': mean_weight},
           inplace=True)

print(df)

   height  weight
0   175.0    70.0
1   180.0     NaN
2     NaN    80.0
3   170.0    75.0

In [14]:
df = pd.DataFrame({
    'name' : ['mohamed','james','boody','salma','anwar','ali','ahmed'],
    'age' : [32,23,45,35,20,28,55],
    'sex' : ['male','male','male','female','male','male','male']
})

In [15]:
df

      name  age     sex
0  mohamed   32    male
1    james   23    male
2    boody   45    male
3    salma   35  female
4    anwar   20    male
5      ali   28    male
6    ahmed   55    male

In [16]:
df.loc[0, 'name']

'mohamed'

In [17]:
df.iloc[0, 0]

'mohamed'

In [18]:
df.loc[0:2, 'name']

0    mohamed
1      james
2      boody
Name: name, dtype: object

In [19]:
df.iloc[0:2, 0]

0    mohamed
1      james
Name: name, dtype: object

In [20]:
df.iloc[0:3, 0]

0    mohamed
1      james
2      boody
Name: name, dtype: object

In [24]:
df.at[5, 'name']

'ali'

In [25]:
df.at[5, 'name'] = 'harry potter'

In [26]:
df.at[5, 'name']

'harry potter'

In [27]:
df

           name  age     sex
0       mohamed   32    male
1         james   23    male
2         boody   45    male
3         salma   35  female
4         anwar   20    male
5  harry potter   28    male
6         ahmed   55    male

In [28]:
# replace "male" with "king"
df.sex.replace({'male' : 'kings'},
              regex=True, inplace=True)

In [29]:
df

           name  age      sex
0       mohamed   32    kings
1         james   23    kings
2         boody   45    kings
3         salma   35  fekings
4         anwar   20    kings
5  harry potter   28    kings
6         ahmed   55    kings

In [32]:
df.at[3,'sex']

'fekings'

In [33]:
df.at[3,'sex'] = 'female'

In [34]:
df.at[3,'sex']

'female'

In [35]:
df

           name  age     sex
0       mohamed   32   kings
1         james   23   kings
2         boody   45   kings
3         salma   35  female
4         anwar   20   kings
5  harry potter   28   kings
6         ahmed   55   kings